
#Область ПрограммныйИнтерфейс

Функция ФормироватьИнтернетСтраницуПрофПоПлатформе(раздел, билет) Экспорт

	ОписаниеСтраницы = "
	|<!DOCTYPE>
	|<html></html>
	|<head></head>
	|<meta>
	|<title></title>
	|<body>
	|	<img src=""&imgURL"" alt=""&imgAlt"">
	|</body>";
	
	imgURL = СтрШаблон("http://sj.massandra.su/prof1c/platform/%1/%2.png", раздел, билет);
	imgAlt = СтрШаблон("Раздел %1, билет %2", раздел, билет);
	
	ОписаниеСтраницы = СтрЗаменить(ОписаниеСтраницы, "&imgURL", imgURL);
	ОписаниеСтраницы = СтрЗаменить(ОписаниеСтраницы, "&imgAlt", imgAlt);
	
	Возврат ОписаниеСтраницы;

КонецФункции // ФормироватьИнтернетСтраницу()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
    // В нем должны быть размещены экспортные процедуры и функции, которые допустимо вызывать только
	// из других функциональных подсистем этой же библиотеки. (например: у объекта есть две формы (А,Б)
	// где форма А содержит "СлужебныйПрограммныйИнтерфейс" который вызывает форма Б (подсистем этой же библиотеки).
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти