
#Область ОписаниеПеременных
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НаборБилетовЭкзамена = ОбщегоНазначения.ПолучитьСлучайныйНаборБилетов(Параметры.ИмяСправочника, Параметры.РазделКод, Параметры.КолБилетов);
	НаполнитьТаблицуБилетами(НаборБилетовЭкзамена);
	НаполнитьПанельСчетчикБилетов(НаборБилетовЭкзамена);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы
	// ЭтаФорма.мБилеты
#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НаполнитьТаблицуБилетами(НаборБилетовЭкзамена)

	Для каждого Билет Из НаборБилетовЭкзамена Цикл
		ЭтаФорма.мБилеты.Очистить();
		нСтрока = ЭтаФорма.мБилеты.Добавить();
		нСтрока.Ссылка = Билет;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура НаполнитьПанельСчетчикБилетов(НаборБилетовЭкзамена)

	Для каждого Билет Из НаборБилетовЭкзамена Цикл
		// Заполняем панель номер билета
	КонецЦикла;

КонецПроцедуры;

#КонецОбласти